zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lptmr_reg.h
     * Offset: 0x4C  LPTMR PWM Period Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PERIOD    |PWM Period Register
     * |        |          |In up count type: PWM counter counts from 0 to PERIOD, and restarts from 0.
     * |        |          |In down count type: PWM counter counts from PERIOD to 0, and restarts from PERIOD.
     * |        |          |In up-down count type: PWM counter counts from 0 to PERIOD, then decrements to 0 and repeats again.
     * |        |          |In up and down count type:
     * |        |          |PWM period time = (PERIOD + 1) * (CLKPSC + 1) * TMRx_PWMCLK.
     * |        |          |In up-down count type:
     * |        |          |PWM period time = 2 * PERIOD * (CLKPSC+ 1) * TMRx_PWMCLK.
     * |        |          |Note: User should take care DIRF (TIMERx_PWMCNT[16]) bit in up/down/up-down count type to monitor current counter direction in each count type.
     * @var LPTMR_T::PWMCMPDAT
     * Offset: 0x50  LPTMR PWM Comparator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMP       |PWM Comparator Register
     * |        |          |PWM CMP is used to compare with PWM CNT to generate PWM output waveform, interrupt events and trigger ADC to start convert.
     * @var LPTMR_T::PWMCNT
     * Offset: 0x54  LPTMR PWM Counter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CNT       |PWM Counter Value Register (Read Only)
     * |        |          |User can monitor CNT to know the current counter value in 16-bit period counter.
     * @var LPTMR_T::PWMPOLCTL
     * Offset: 0x58  LPTMR PWM Pin Output Polar Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PINV      |PWMx Output Pin Polar Control Bit
     * |        |          |The bit is used to control polarity state of PWMx output pin.
     * |        |          |0 = PWMx output pin polar inverse Disabled.
     * |        |          |1 = PWMx output pin polar inverse Enabled.
     * @var LPTMR_T::PWMPOCTL
     * Offset: 0x5C  LPTMR PWM Pin Output Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |POEN      |PWMx Output Pin Enable Bit
     * |        |          |0 = PWMx Output pin at tri-state mode.
     * |        |          |1 = PWMx Output pin in output mode.
     * |[8]     |POSEL     |PWM Output Pin Select
     * |        |          |0 = PWMx_OUT pin is LPTMx.
     * |        |          |1 = PWMx_OUT pin is LPTMx_EXT.
     * @var LPTMR_T::PWMINTEN0
     * Offset: 0x60  LPTMR PWM Interrupt Enable Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |PIEN      |PWM Period Point Interrupt Enable Bit
     * |        |          |0 = Period point interrupt Disabled.
     * |        |          |1 = Period point interrupt Enabled.
     * |        |          |Note: When in up-down count type, period point means the center point of current PWM period.
     * |[2]     |CMPUIEN   |PWM Compare Up Count Interrupt Enable Bit
     * |        |          |0 = Compare up count interrupt Disabled.
     * |        |          |1 = Compare up count interrupt Enabled.
     * @var LPTMR_T::PWMINTSTS0
     * Offset: 0x64  LPTMR PWM Interrupt Status Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |PIF       |PWM Period Point Interrupt Flag
     * |        |          |This bit is set by hardware when TIMERx_PWM counter reaches PERIOD.
     * |        |          |Note1: When in up-down count type, PIF flag means the center point flag of current PWM period.
     * |        |          |Note2: This bit is cleared by writing 1 to it.
     * |[2]     |CMPUIF    |PWM Compare Up Count Interrupt Flag
     * |        |          |This bit is set by hardware when TIMERx_PWM counter in up count direction and reaches CMP.
     * |        |          |Note1: If CMP equal to PERIOD, there is no CMPUIF flag in up count type and up-down count type.
     * |        |          |Note2: This bit is cleared by writing 1 to it.
     * @var LPTMR_T::PWMTRGCTL
     * Offset: 0x68  LPTMR PWM Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |TRGSEL    |PWM Counter Event Source Select to Trigger Conversion
     * |        |          |00 = Trigger conversion at period point (PIF).
     * |        |          |01 = Trigger conversion at compare up count point (CMPUIF).
     * |        |          |10 = Trigger conversion at period or compare up count point (PIF or CMPUIF).
     * |        |          |11 = Reserved.
     * |[2]     |TRGEN     |Trigger Low power IPs Enable Bit
     * |        |          |0 = Low Power Timer PWM counter event trigger Low Power IPs Disabled.
     * |        |          |1 = Low Power Timer PWM counter event trigger Low Power IPs Enabled.
     * |[9]     |PWMTRGLPPDMA|PWM Counter Event Trigger LPPDMA Conversion Enable Bit
     * |        |          |0 = PWM counter event trigger LPPDMA conversion Disabled.
     * |        |          |1 = PWM counter event trigger LPPDMA conversion Enabled.
     * |[10]    |AEPDMA    |Accumulator Every IFACNT LPPDMA Mode Enable Bit
     * |        |          |0 = Trigger LPPDMA Accumulator Mode Disabled.
     * |        |          |1 = Trigger LPPDMA Accumulator Mode Enabled.
     * @var LPTMR_T::PWMSTATUS
     * Offset: 0x6C  LPTMR PWM Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CNTMAXF   |PWM Counter Equal to 0xFFFF Flag
     * |        |          |0 = Indicates the PWM counter value never reached its maximum value 0xFFFF.
     * |        |          |1 = Indicates the PWM counter value has reached its maximum value.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[16]    |PWMINTWKF |PWM Interrupt Wake-up Flag
     * |        |          |0 = PWM interrupt wake-up has not occurred.
     * |        |          |1 = PWM interrupt wake-up has occurred.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * @var LPTMR_T::PWMPBUF
     * Offset: 0x70  LPTMR PWM Period Buffer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PBUF      |PWM Period Buffer Register (Read Only)
     * |        |          |Used as PERIOD active register.
     * @var LPTMR_T::PWMCMPBUF
     * Offset: 0x74  LPTMR PWM Comparator Buffer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMPBUF    |PWM Comparator Buffer Register (Read Only)
     * |        |          |Used as CMP active register.
     * @var LPTMR_T::PWMIFA
     * Offset: 0xA8  LPTMR PWM Interrupt Flag Accumulator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |IFACNT    |PWM Interrupt Flag Accumulator Counter
     * |        |          |This field sets the count number which defines (IFACNT+1) times of specify PWM interrupt occurs to set IFAIF bit to request the PWM accumulator interrupt.
     * |        |          |PWM accumulator flag (IFAIF) will be set in every (IFACNT+1) times during the the PWM counter operation.
     * |[24]    |STPMOD    |PWM Accumulator Stop Mode Enable Bit
     * |        |          |0 = PWM interrupt accumulator event to stop counting Disabled.
     * |        |          |1 = PWM interrupt accumulator event to stop counting Enabled.
     * |[29:28] |IFASEL    |PWM Interrupt Flag Accumulator Source Select
     * |        |          |00 = Accumulate at each PWM zero point.
     * |        |          |01 = Accumulate at each PWM period point.
     * |        |          |10 = Accumulate at each PWM up-count compared point.
     * |        |          |11 = Accumulate at each PWM down-count compared point.
     * |[31]    |IFAEN     |PWM Interrupt Flag Accumulator Enable Bit
     * |        |          |0 = PWM interrupt flag accumulator function Disabled.
     * |        |          |1 = PWM interrupt flag accumulator function Enabled.
     * @var LPTMR_T::PWMAINTSTS
     * Offset: 0xAC  LPTMR PWM Accumulator Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IFAIF     |PWM Interrupt Flag Accumulator Interrupt Flag
     * |        |          |This bit is set by hardware when the accumulator value reaches (IFACNT+1).
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * |        |          |Note 2: If APDMAEN (TIMERx_PWMAPDMACTL[0]) is set, this bit will be auto clear after PDMA transfer done.
     * @var LPTMR_T::PWMAINTEN
     * Offset: 0xB0  LPTMR PWM Accumulator Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IFAIEN    |PWM Interrupt Flag Accumulator Interrupt Enable Bit
     * |        |          |0 = Interrupt Flag Accumulator interrupt Disabled.
     * |        |          |1 = Interrupt Flag Accumulator interrupt Enabled.
     * @var LPTMR_T::PWMAPDMACTL
     * Offset: 0xB4  LPTMR PWM Accumulator PDMA Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |APDMAEN   |PWM Accumulator PDMA Enable Bit
     * |        |          |0 = PWM interrupt accumulator event to trigger PDMA transfer Disabled.
     * |        |          |1 = PWM interrupt accumulator event to trigger PDMA transfer Enabled.
     */
    __IO uint32_t CTL;              /*!< [0x00] LPTMRx Control Register                                 */
    __IO uint32_t CMP;              /*!< [0x04] LPTMRx Comparator Register                              */
    __IO uint32_t INTSTS;           /*!< [0x08] LPTMRx Interrupt Status Register                        */
    __IO uint32_t CNT;              /*!< [0x0C] LPTMRx Data Register                                    */
    __I  uint32_t CAP;              /*!< [0x10] LPTMRx Capture Data Register                            */
    __IO uint32_t EXTCTL;           /*!< [0x14] LPTMRx External Control Register                        */
    __IO uint32_t EINTSTS;          /*!< [0x18] LPTMRx External Interrupt Status Register               */
    __IO uint32_t TRGCTL;           /*!< [0x1C] LPTMRx Trigger Control Register                         */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t CAPNF;            /*!< [0x24] LPTMRx Capture Input Noise Filter Register              */
    __I  uint32_t RESERVE1[6];
    __IO uint32_t PWMCTL;           /*!< [0x40] LPTMRx PWM Control Register                             */
    __IO uint32_t PWMCLKPSC;        /*!< [0x44] LPTMRx PWM Counter Clock Pre-scale Register             */
    __IO uint32_t PWMCNTCLR;        /*!< [0x48] LPTMRx PWM Clear Counter Register                       */
    __IO uint32_t PWMPERIOD;        /*!< [0x4C] LPTMRx PWM Period Register                              */
    __IO uint32_t PWMCMPDAT;        /*!< [0x50] LPTMRx PWM Comparator Register                          */
    __I  uint32_t PWMCNT;           /*!< [0x54] LPTMRx PWM Counter Register                             */
    __IO uint32_t PWMPOLCTL;        /*!< [0x58] LPTMRx PWM Pin Output Polar Control Register            */
    __IO uint32_t PWMPOCTL;         /*!< [0x5C] LPTMRx PWM Pin Output Control Register                  */
    __IO uint32_t PWMINTEN0;        /*!< [0x60] LPTMRx PWM Interrupt Enable Register 0                  */
    __IO uint32_t PWMINTSTS0;       /*!< [0x64] LPTMRx PWM Interrupt Status Register 0                  */
    __IO uint32_t PWMTRGCTL;        /*!< [0x68] LPTMRx PWM Trigger Control Register                     */
    __IO uint32_t PWMSTATUS;        /*!< [0x6C] LPTMRx PWM Status Register                              */
    __I  uint32_t PWMPBUF;          /*!< [0x70] LPTMRx PWM Period Buffer Register                       */
    __I  uint32_t PWMCMPBUF;        /*!< [0x74] LPTMRx PWM Comparator Buffer Register                   */
    __I  uint32_t RESERVE2[12];
    __IO uint32_t PWMIFA;           /*!< [0xA8] LPTMRx PWM Interrupt Flag Accumulator Register          */
    __IO uint32_t PWMAINTSTS;       /*!< [0xAC] LPTMRx PWM Accumulator Interrupt Flag Register          */
    __IO uint32_t PWMAINTEN;        /*!< [0xB0] LPTMRx PWM Accumulator Interrupt Enable Register        */
    __IO uint32_t PWMAPDMACTL;      /*!< [0xB4] LPTMRx PWM Accumulator LPPDMA Control Register          */
} LPTMR_T;

/**
    @addtogroup LPTMR_CONST TIMER Bit Field Definition
    Constant Definitions for LPTMR Controller
@{ */

