zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lptmr_reg.h
#define LPTMR_CAPNF_CAPNFEN_Pos         (0)                                         /*!< LPTMR_T::CAPNF: CAPNFEN Position           */
#define LPTMR_CAPNF_CAPNFEN_Msk         (0x1UL << LPTMR_CAPNF_CAPNFEN_Pos)          /*!< LPTMR_T::CAPNF: CAPNFEN Mask               */

#define LPTMR_CAPNF_CAPNFSEL_Pos        (4)                                         /*!< LPTMR_T::CAPNF: CAPNFSEL Position          */
#define LPTMR_CAPNF_CAPNFSEL_Msk        (0x7UL << LPTMR_CAPNF_CAPNFSEL_Pos)         /*!< LPTMR_T::CAPNF: CAPNFSEL Mask              */

#define LPTMR_CAPNF_CAPNFCNT_Pos        (8)                                         /*!< LPTMR_T::CAPNF: CAPNFCNT Position          */
#define LPTMR_CAPNF_CAPNFCNT_Msk        (0x7UL << LPTMR_CAPNF_CAPNFCNT_Pos)         /*!< LPTMR_T::CAPNF: CAPNFCNT Mask              */

#define LPTMR_PWMCTL_CNTEN_Pos          (0)                                         /*!< LPTMR_T::PWMCTL: CNTEN Position            */
#define LPTMR_PWMCTL_CNTEN_Msk          (0x1UL << LPTMR_PWMCTL_CNTEN_Pos)           /*!< LPTMR_T::PWMCTL: CNTEN Mask                */

#define LPTMR_PWMCTL_CNTMODE_Pos        (3)                                         /*!< LPTMR_T::PWMCTL: CNTMODE Position          */
#define LPTMR_PWMCTL_CNTMODE_Msk        (0x1UL << LPTMR_PWMCTL_CNTMODE_Pos)         /*!< LPTMR_T::PWMCTL: CNTMODE Mask              */

#define LPTMR_PWMCTL_PWMINTWKEN_Pos     (12)                                        /*!< LPTMR_T::PWMCTL: PWMINTWKEN Position       */
#define LPTMR_PWMCTL_PWMINTWKEN_Msk     (0x1UL << LPTMR_PWMCTL_PWMINTWKEN_Pos)      /*!< LPTMR_T::PWMCTL: PWMINTWKEN Mask           */

#define LPTMR_PWMCTL_DBGHALT_Pos        (30)                                        /*!< LPTMR_T::PWMCTL: DBGHALT Position          */
#define LPTMR_PWMCTL_DBGHALT_Msk        (0x1UL << LPTMR_PWMCTL_DBGHALT_Pos)         /*!< LPTMR_T::PWMCTL: DBGHALT Mask              */

#define LPTMR_PWMCTL_DBGTRIOFF_Pos      (31)                                        /*!< LPTMR_T::PWMCTL: DBGTRIOFF Position        */
#define LPTMR_PWMCTL_DBGTRIOFF_Msk      (0x1UL << LPTMR_PWMCTL_DBGTRIOFF_Pos)       /*!< LPTMR_T::PWMCTL: DBGTRIOFF Mask            */

#define LPTMR_PWMCLKPSC_CLKPSC_Pos      (0)                                         /*!< LPTMR_T::PWMCLKPSC: CLKPSC Position        */
#define LPTMR_PWMCLKPSC_CLKPSC_Msk      (0xffUL << LPTMR_PWMCLKPSC_CLKPSC_Pos)      /*!< LPTMR_T::PWMCLKPSC: CLKPSC Mask            */

#define LPTMR_PWMCNTCLR_CNTCLR_Pos      (0)                                         /*!< LPTMR_T::PWMCNTCLR: CNTCLR Position        */
#define LPTMR_PWMCNTCLR_CNTCLR_Msk      (0x1UL << LPTMR_PWMCNTCLR_CNTCLR_Pos)       /*!< LPTMR_T::PWMCNTCLR: CNTCLR Mask            */

#define LPTMR_PWMPERIOD_PERIOD_Pos      (0)                                         /*!< LPTMR_T::PWMPERIOD: PERIOD Position        */
#define LPTMR_PWMPERIOD_PERIOD_Msk      (0xffffUL << LPTMR_PWMPERIOD_PERIOD_Pos)    /*!< LPTMR_T::PWMPERIOD: PERIOD Mask            */

#define LPTMR_PWMCMPDAT_CMP_Pos         (0)                                         /*!< LPTMR_T::PWMCMPDAT: CMP Position           */
#define LPTMR_PWMCMPDAT_CMP_Msk         (0xffffUL << LPTMR_PWMCMPDAT_CMP_Pos)       /*!< LPTMR_T::PWMCMPDAT: CMP Mask               */

#define LPTMR_PWMCNT_CNT_Pos            (0)                                         /*!< LPTMR_T::PWMCNT: CNT Position              */
#define LPTMR_PWMCNT_CNT_Msk            (0xffffUL << LPTMR_PWMCNT_CNT_Pos)          /*!< LPTMR_T::PWMCNT: CNT Mask                  */

#define LPTMR_PWMPOLCTL_PINV_Pos        (0)                                         /*!< LPTMR_T::PWMPOLCTL: PINV Position          */
#define LPTMR_PWMPOLCTL_PINV_Msk        (0x1UL << LPTMR_PWMPOLCTL_PINV_Pos)         /*!< LPTMR_T::PWMPOLCTL: PINV Mask              */

#define LPTMR_PWMPOCTL_POEN_Pos         (0)                                         /*!< LPTMR_T::PWMPOCTL: POEN Position           */
#define LPTMR_PWMPOCTL_POEN_Msk         (0x1UL << LPTMR_PWMPOCTL_POEN_Pos)          /*!< LPTMR_T::PWMPOCTL: POEN Mask               */

#define LPTMR_PWMPOCTL_POSEL_Pos        (8)                                         /*!< LPTMR_T::PWMPOCTL: POSEL Position          */
#define LPTMR_PWMPOCTL_POSEL_Msk        (0x1UL << LPTMR_PWMPOCTL_POSEL_Pos)         /*!< LPTMR_T::PWMPOCTL: POSEL Mask              */

#define LPTMR_PWMINTEN0_PIEN_Pos        (1)                                         /*!< LPTMR_T::PWMINTEN0: PIEN Position          */
#define LPTMR_PWMINTEN0_PIEN_Msk        (0x1UL << LPTMR_PWMINTEN0_PIEN_Pos)         /*!< LPTMR_T::PWMINTEN0: PIEN Mask              */

#define LPTMR_PWMINTEN0_CMPUIEN_Pos     (2)                                         /*!< LPTMR_T::PWMINTEN0: CMPUIEN Position       */
#define LPTMR_PWMINTEN0_CMPUIEN_Msk     (0x1UL << LPTMR_PWMINTEN0_CMPUIEN_Pos)      /*!< LPTMR_T::PWMINTEN0: CMPUIEN Mask           */

#define LPTMR_PWMINTSTS0_PIF_Pos        (1)                                         /*!< LPTMR_T::PWMINTSTS0: PIF Position          */
#define LPTMR_PWMINTSTS0_PIF_Msk        (0x1UL << LPTMR_PWMINTSTS0_PIF_Pos)         /*!< LPTMR_T::PWMINTSTS0: PIF Mask              */

#define LPTMR_PWMINTSTS0_CMPUIF_Pos     (2)                                         /*!< LPTMR_T::PWMINTSTS0: CMPUIF Position       */
#define LPTMR_PWMINTSTS0_CMPUIF_Msk     (0x1UL << LPTMR_PWMINTSTS0_CMPUIF_Pos)      /*!< LPTMR_T::PWMINTSTS0: CMPUIF Mask           */

#define LPTMR_PWMTRGCTL_TRGSEL_Pos      (0)                                         /*!< LPTMR_T::PWMTRGCTL: TRGSEL Position        */
#define LPTMR_PWMTRGCTL_TRGSEL_Msk      (0x3UL << LPTMR_PWMTRGCTL_TRGSEL_Pos)       /*!< LPTMR_T::PWMTRGCTL: TRGSEL Mask            */

#define LPTMR_PWMTRGCTL_TRGEN_Pos       (2)                                         /*!< LPTMR_T::PWMTRGCTL: TRGEN Position         */
#define LPTMR_PWMTRGCTL_TRGEN_Msk       (0x1UL << LPTMR_PWMTRGCTL_TRGEN_Pos)        /*!< LPTMR_T::PWMTRGCTL: TRGEN Mask             */

#define LPTMR_PWMTRGCTL_PWMTRGLPPDMA_Pos    (9)                                         /*!< LPTMR_T::PWMTRGCTL: PWMTRGLPPDMA Position  */
#define LPTMR_PWMTRGCTL_PWMTRGLPPDMA_Msk    (0x1UL << LPTMR_PWMTRGCTL_PWMTRGLPPDMA_Pos) /*!< LPTMR_T::PWMTRGCTL: PWMTRGLPPDMA Mask      */

