zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lptmr_reg.h
#define LPTMR_PWMTRGCTL_AEPDMA_Pos      (10)                                        /*!< LPTMR_T::PWMTRGCTL: AEPDMA Position  */
#define LPTMR_PWMTRGCTL_AEPDMA_Msk      (0x1UL << LPTMR_PWMTRGCTL_AEPDMA_Pos)       /*!< LPTMR_T::PWMTRGCTL: AEPDMA Mask      */

#define LPTMR_PWMSTATUS_CNTMAXF_Pos     (0)                                         /*!< LPTMR_T::PWMSTATUS: CNTMAXF Position       */
#define LPTMR_PWMSTATUS_CNTMAXF_Msk     (0x1UL << LPTMR_PWMSTATUS_CNTMAXF_Pos)      /*!< LPTMR_T::PWMSTATUS: CNTMAXF Mask           */

#define LPTMR_PWMSTATUS_PWMINTWKF_Pos   (8)                                         /*!< LPTMR_T::PWMSTATUS: PWMINTWKF Position     */
#define LPTMR_PWMSTATUS_PWMINTWKF_Msk   (0x1UL << LPTMR_PWMSTATUS_PWMINTWKF_Pos)    /*!< LPTMR_T::PWMSTATUS: PWMINTWKF Mask         */

#define LPTMR_PWMPBUF_PBUF_Pos          (0)                                         /*!< LPTMR_T::PWMPBUF: PBUF Position            */
#define LPTMR_PWMPBUF_PBUF_Msk          (0xffffUL << LPTMR_PWMPBUF_PBUF_Pos)        /*!< LPTMR_T::PWMPBUF: PBUF Mask                */

#define LPTMR_PWMCMPBUF_CMPBUF_Pos      (0)                                         /*!< LPTMR_T::PWMCMPBUF: CMPBUF Position        */
#define LPTMR_PWMCMPBUF_CMPBUF_Msk      (0xffffUL << LPTMR_PWMCMPBUF_CMPBUF_Pos)    /*!< LPTMR_T::PWMCMPBUF: CMPBUF Mask            */

#define LPTMR_PWMIFA_IFACNT_Pos         (0)                                         /*!< LPTMR_T::PWMIFA: IFACNT Position           */
#define LPTMR_PWMIFA_IFACNT_Msk         (0xffffUL << LPTMR_PWMIFA_IFACNT_Pos)       /*!< LPTMR_T::PWMIFA: IFACNT Mask               */

#define LPTMR_PWMIFA_STPMOD_Pos         (24)                                        /*!< LPTMR_T::PWMIFA: STPMOD Position           */
#define LPTMR_PWMIFA_STPMOD_Msk         (0x1UL << LPTMR_PWMIFA_STPMOD_Pos)          /*!< LPTMR_T::PWMIFA: STPMOD Mask               */

#define LPTMR_PWMIFA_IFASEL_Pos         (28)                                        /*!< LPTMR_T::PWMIFA: IFASEL Position           */
#define LPTMR_PWMIFA_IFASEL_Msk         (0x3UL << LPTMR_PWMIFA_IFASEL_Pos)          /*!< LPTMR_T::PWMIFA: IFASEL Mask               */

#define LPTMR_PWMIFA_IFAEN_Pos          (31)                                        /*!< LPTMR_T::PWMIFA: IFAEN Position            */
#define LPTMR_PWMIFA_IFAEN_Msk          (0x1UL << LPTMR_PWMIFA_IFAEN_Pos)           /*!< LPTMR_T::PWMIFA: IFAEN Mask                */

#define LPTMR_PWMAINTSTS_IFAIF_Pos      (0)                                         /*!< LPTMR_T::PWMAINTSTS: IFAIF Position        */
#define LPTMR_PWMAINTSTS_IFAIF_Msk      (0x1UL << LPTMR_PWMAINTSTS_IFAIF_Pos)       /*!< LPTMR_T::PWMAINTSTS: IFAIF Mask            */

#define LPTMR_PWMAINTEN_IFAIEN_Pos      (0)                                         /*!< LPTMR_T::PWMAINTEN: IFAIEN Position        */
#define LPTMR_PWMAINTEN_IFAIEN_Msk      (0x1UL << LPTMR_PWMAINTEN_IFAIEN_Pos)       /*!< LPTMR_T::PWMAINTEN: IFAIEN Mask            */

#define LPTMR_PWMAPDMACTL_APDMAEN_Pos   (0)                                         /*!< LPTMR_T::PWMAPDMACTL: APDMAEN Position     */
#define LPTMR_PWMAPDMACTL_APDMAEN_Msk   (0x1UL << LPTMR_PWMAPDMACTL_APDMAEN_Pos)    /*!< LPTMR_T::PWMAPDMACTL: APDMAEN Mask         */

/** @} LPTMR_CONST */
/** @} end of LPTMR register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPTMR_REG_H__ */
